# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()
#Your code here

## Display the names of all the employees in Boston.

In [11]:
cur.execute("""select firstName, lastName from employees join offices using(officeCode) where city = 'Boston';""")
cur.fetchall()

#Your code here

[('Julie', 'Firrelli'), ('Steve', 'Patterson')]


## Do any offices have no employees?

In [17]:
cur.execute('''SELECT city, count(*) FROM offices left join employees using(officeCode) GROUP BY 1;''')
df=pd.DataFrame(cur.fetchall())
df.head(12)

               0  1
0         Boston  2
1         London  2
2            NYC  2
3          Paris  5
4  San Francisco  6
5         Sydney  4
6          Tokyo  2

## Write 3 Questions of your own and answer them

In [15]:
cur.execute('''SELECT productCode, count(*) FROM orderdetails left join orders using(orderNumber) GROUP BY 1;''')
df=pd.DataFrame(cur.fetchall())
df.head(10)


# Answers will vary
# Was attemting to see which products had the most sales

          0   1
0  S10_1678  28
1  S10_1949  28
2  S10_2016  28
3  S10_4698  28
4  S10_4757  28
5  S10_4962  28
6  S12_1099  27
7  S12_1108  27
8  S12_1666  28
9  S12_2823  28

In [18]:
cur.execute('''SELECT country, count(*) FROM offices left join employees using(officeCode) GROUP BY 1;''')
df=pd.DataFrame(cur.fetchall())
df.head(12)

# Your code here
# was attempting to ask the same question about cities.  If there was any countries that had zero employees
# Although if the all the cities have employees there are probably no countries without employees. Anyway just an exercize

           0   1
0  Australia   4
1     France   5
2      Japan   2
3         UK   2
4        USA  10

In [36]:
cur.execute('''SELECT city, count(*) FROM customers c join employees e on c.salesRepEmployeeNumber = e.employeeNumber order BY 1 desc;''')
df2=pd.DataFrame(cur.fetchall())
df2.head(5)

# Was attempting to see the city with the most customers

        0    1
0  Nantes  100

## Level Up: Display the names of each product each employee has sold.

In [32]:
cur.execute("""select firstName, lastName,
                      productName
                      from employees e
                      join
                      customers c
                      on e.employeeNumber = c.salesRepEmployeeNumber
                      join orders o
                      using(customerNumber)
                      join orderdetails od
                      using(orderNumber)
                      join products p
                      using(productCode)""")
df = pd.DataFrame(cur.fetchall())
print(len(df))
df.head()
# Your code here

2996

        0         1                                            2
0  Leslie  Jennings                               1958 Setra Bus
1  Leslie  Jennings                       1940 Ford Pickup Truck
2  Leslie  Jennings                      1939 Cadillac Limousine
3  Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4  Leslie  Jennings                            1968 Ford Mustang

## Level Up: Display the Number of Products each Employee Has sold

In [33]:
df.groupby([0,1]).count()
#Your code here

                      2
0        1
Andy     Fixter     185
Barry    Jones      220
Foon Yue Tseng      142
George   Vanauf     211
Gerard   Hernandez  396
Julie    Firrelli   124
Larry    Bott       236
Leslie   Jennings   331
         Thompson   114
Loui     Bondur     177
Mami     Nishi      137
Martin   Gerard     114
Pamela   Castillo   272
Peter    Marsh      185
Steve    Patterson  152

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!